app/views/tracks/edit.html.erb


  <%= f.collection_check_boxes :lesson_ids, Lesson.all, :id, :title %><br>
---
SELECT "lessons".* FROM "lessons"