app/views/tracks/new.html.erb

SELECT "lessons".* FROM "lessons"
---
  <%= f.text_area :content %>
  <%= f.collection_check_boxes :lesson_ids, Lesson.all, :id, :name %>