app/views/tracks/show.html.erb

<h3>Lessons in this Track: </h3>
  <% @track.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" INNER JOIN "track_lessons" ON "lessons"."id" = "track_lessons"."lesson_id" WHERE "track_lessons"."track_id" = ?  [["track_id", 1]]