app/views/tracks/show.html.erb

SELECT "track_lessons".* FROM "track_lessons" WHERE "track_lessons"."track_id" = ?  [["track_id", 9]]
---
<h2>Lessons in this Track: </h2>
<% @track.track_lessons.each do |tl| %>