app/views/charts/show.html.erb

  Title:      <%= @chart.title %><br>
  MP3 Title:  <%= "#{Mp3.find(@chart.mp3_id).title}" %><br>
---
SELECT  "mp3s".* FROM "mp3s" WHERE "mp3s"."id" = ? LIMIT 1  [["id", 1]]