app/views/mp3s/show.html.erb

<h2>Lessons using this Tune: </h2>
<% @mp3.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" INNER JOIN "lesson_mp3s" ON "lessons"."id" = "lesson_mp3s"."lesson_id" WHERE "lesson_mp3s"."mp3_id" = ?  [["mp3_id", 2]]