app/views/lessons/new.html.erb

SELECT "mp3s".* FROM "mp3s"
---
  <%= f.text_area :content %>
  <%= f.collection_check_boxes :mp3_ids, Mp3.all, :id, :title %>