app/controllers/charts_controller.rb

  def index
    @charts = Chart.all
---
SELECT "charts".* FROM "charts"

  def show
    @chart = Chart.find(params[:id])
---
SELECT  "charts".* FROM "charts" WHERE "charts"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @chart = Chart.create(chart_params)
---
INSERT INTO "charts" ("title", "mp3_id", "file_location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "All Blues"], ["mp3_id", 1], ["file_location", "C drive"], ["created_at", "2016-10-16 17:04:17.138884"], ["updated_at", "2016-10-16 17:04:17.138884"]]