app/controllers/lessons_controller.rb

SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @lesson = Lesson.find(params[:id])

INSERT INTO "lessons" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Chord Triads"], ["created_at", "2016-10-19 22:53:03.139267"], ["updated_at", "2016-10-19 22:53:03.139267"]]
---
  def create
    @lesson = Lesson.create(lesson_params)