app/controllers/mp3s_controller.rb

SELECT "mp3s".* FROM "mp3s"
---
  def index
    @mp3s = Mp3.all

SELECT  "mp3s".* FROM "mp3s" WHERE "mp3s"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @mp3 = Mp3.find(params[:id])

INSERT INTO "mp3s" ("title", "file_location", "chart_id", "youtubelink", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @mp3 = Mp3.create(mp3_params)

SELECT  "mp3s".* FROM "mp3s" WHERE "mp3s"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @mp3 = Mp3.find(params[:id])

SELECT  "mp3s".* FROM "mp3s" WHERE "mp3s"."title" = ? LIMIT 1  [["title", "All Blues"]]
UPDATE "mp3s" SET "file_location" = ?, "chart_id" = ?, "youtubelink" = ?, "updated_at" = ? WHERE "mp3s"."id" = ?  [["file_location", "dropbox"], ["chart_id", 1], ["youtubelink", "https://www.youtube.com/watch?v=8z-dDWrIKDQ"], ["updated_at", "2016-10-20 12:20:34.676508"], ["id", 1]]
---
  def update
# raise params.inspect
    @mp3 = Mp3.find_by(title: params[:mp3][:title])
    @mp3.update(mp3_params)