app/controllers/tracks_controller.rb

  def show
    @track = Track.find(params[:id])
    @track_lessons = []
    @track.track_lessons.each do |tl|
      @track_lessons << Lesson.find_by(track_id: tl.lesson_id)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 11]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."track_id" = ?  [[nil, 11]]
SELECT "track_lessons".* FROM "track_lessons" WHERE "track_lessons"."track_id" = ?  [["track_id", 9]]
SELECT "lessons".* FROM "lessons" INNER JOIN "track_lessons" ON "lessons"."id" = "track_lessons"."lesson_id" WHERE "track_lessons"."track_id" = ?  [["track_id", 1]]

  def create
    @track = Track.create(track_params)
---
INSERT INTO "tracks" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bebop Lines"], ["content", "Start with Chord Tone Lesson, and Giant STeps"], ["created_at", "2016-10-21 03:21:42.880313"], ["updated_at", "2016-10-21 03:21:42.880313"]]