app/controllers/tracks_controller.rb

  def update
    @track = Track.find_by(name: params[:track][:name])
    @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."name" = ? LIMIT 1  [["name", "Stride Piano"]]
UPDATE "tracks" SET "content" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["content", ""], ["updated_at", "2016-10-21 16:59:41.595437"], ["id", 4]]